# Auto-generated by run_innovus_hier.do -- DO NOT EDIT BY HAND.
create_constraint_mode -name func_mode -sdc_files [list out_sweep/stream_pipeline_64x64_hier/stream_pipeline.sdc]
create_library_set    -name lib_tt -timing [list /pkgs/synopsys/2020/32_28nm/SAED32_EDK/lib/stdcell_rvt/db_nldm/saed32rvt_pg_tt0p85v25c.lib]
create_rc_corner      -name rc_typ -T 25
create_delay_corner   -name dc_typ -library_set lib_tt -rc_corner rc_typ
create_analysis_view  -name av_typ -constraint_mode func_mode -delay_corner dc_typ
set_analysis_view     -setup [list av_typ] -hold [list av_typ]
